// Циклы while и for

// 1....................................................................................................

// for (let i = 1; i <= 100; i++) {
// 	console.log(i);
// }

// let i = 1;
// while (i <= 100) {
// 	console.log(i);
// 	i++;
// }

// 2...................................................................................................

// for (let i = 11; i <= 33; i++) {
// 	console.log(i);
// }

// let i = 11;
// while (i <= 33) {
// 	console.log(i);
// 	i++;
// }

// 3...................................................................................................

// for (let i = 0; i <= 100; i++) {
// 	console.log(i);
// 	i++;
// }

// let i = 0;
// while (i <= 100) {
// 	console.log(i);
// 	i++;
// 	i++;
// }

// 4...................................................................................................

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
// 	sum += i;
// }
// console.log(sum);

// let i = 1;
// while (i <= 100) {
// 	sum += i;
// 	i++;
// }
// console.log(sum);


///////////////////////////////////////////////////////////////////////////////////////////////////////

// Работа с for для массивов

// 1...................................................................................................

// let mas = [1, 2, 3, 4, 5];

// for (let i = 0; i < mas.length; i++) {
// 	console.log(mas[i]);
// }

// 2...................................................................................................

// let mas = [1, 2, 3, 4, 5];
// let result = 0;

// for (let i = 0; i < mas.length; i++) {
// 	result += mas[i];
// }
// console.log(result);

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Работа с for-in

// 1...................................................................................................

// var obj = {green: 'зелёный',
// 			red: 'красный',
// 			blue: 'голубой'}

// for (let i in obj) {
// 	console.log(i);
// 	console.log(obj[i]);
// }

// 2...................................................................................................

// var obj = {Коля: '200',
// 			Вася: '300',
// 			Петя: '400'}

// for (let i in obj) {
// 	console.log(`${i} - зарплата ${obj[i]} долларов`);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Задачи

// 1

// let mas = [2, 5, 9, 15, 0, 4];

// for (let i in mas) {
// 	if (mas[i] > 3 && mas[i] < 10) {
// 		console.log(mas[i]);
// 	}
// }

// 2

// let mas = [2, 5, 9, 14, 0, 4];
// let sum = 0;
// for (let i in mas) {
// 	if (mas[i] % 2 == 0) {
// 		sum += mas[i];
// 	}
// }
// console.log(sum);

// 3

// mas = [1, 2, 5, 9, 4, 13, 4, 10];

// for (let i in mas) {
// 	if (mas[i] == 4) {
// 		console.log('Есть!');
// 		break;
// 	}
// }

// 4

// mas = [10, 20, 30, 50, 235, 3000];

// for (let i in mas) {
// 	if (String(mas[i])[0] == '1' || String(mas[i])[0] == '2' || String(mas[i])[0] == '5') {
// 		console.log(mas[i]);
// 	}
// }

// 5

// mas = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let stroka = '-';

// for (let i in mas) {
// 	stroka += `${mas[i]}-`;
// }
// console.log(stroka);


// 6

// let dninedeli = ['Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье', 'Понедельник', 'Вторник'];
// const bold = "font-weight: bold;";

// for (let i in dninedeli) {
// 	if (dninedeli[i] == 'Суббота' || dninedeli[i] == 'Воскресенье') {
// 		console.log(`%c${dninedeli[i]}`, bold); // плохо видно, но шрифт жирный
// 	} else {
// 		console.log(`${dninedeli[i]}`);
// 	}
// }

// 7 

// const cursive = "font-style: oblique;";
// let dninedeli = ['Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье', 'Понедельник', 'Вторник'];
// day = "Четверг";

// for (let i in dninedeli) {
// 	if (dninedeli[i] == day) {
// 		console.log(`%c${dninedeli[i]}`, cursive);
// 	} else {
// 		console.log(dninedeli[i]);
// 	}
// }

// 8

// let num = 0;

// for (let n = 1000; n > 50; n /= 2) {
// 	num++;
// }

// console.log(num);